# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print('Введите 3-х значное число : ')
a =  input()
b = ( (int(a) // 10 % 10) + (int(a) // 100) + (int(a) % 10))
print ( a, '->', b, '(',(int(a) // 100),'+',(int(a) // 10 % 10),'+', (int(a) % 10),')')
